; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	infrared0 - mode
	image1 - mode
	infrared2 - mode
	Star4 - direction
	Star3 - direction
	GroundStation0 - direction
	Star2 - direction
	Star1 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 infrared2)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared0)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star4)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared2)
	(supports instrument6 infrared0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star4)
	(supports instrument8 infrared2)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet9)
	(supports instrument9 image1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 infrared2)
	(calibration_target instrument10 Star2)
	(supports instrument11 image1)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star1)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite5 Planet6)
	(have_image Star5 infrared2)
	(have_image Planet6 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 infrared2)
	(have_image Planet10 image1)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon12 infrared2)
))

)

; plan
1. (turn_to satellite5 planet6 star2)
   deleted: (pointing satellite5 star2)
   added: (pointing satellite5 planet6)
   goals met: 1 of 10
2. (turn_to satellite0 star3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star3)
   goals met: 1 of 10
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
4. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 1 of 10
5. (turn_to satellite0 planet10 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet10)
   goals met: 1 of 10
6. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 10
7. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 10
8. (take_image satellite0 phenomenon7 instrument0 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon12 instrument0 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 4 of 10
11. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 10
12. (take_image satellite0 phenomenon11 instrument0 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 5 of 10
13. (turn_to satellite0 planet6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet6)
   goals met: 5 of 10
14. (take_image satellite0 planet6 instrument0 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 6 of 10
15. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 6 of 10
16. (take_image satellite0 planet9 instrument0 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 7 of 10
17. (turn_to satellite0 star5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star5)
   goals met: 7 of 10
18. (take_image satellite0 star5 instrument0 infrared2)
   added: (have_image star5 infrared2)
   goals met: 8 of 10
19. (turn_to satellite0 phenomenon8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon8)
   goals met: 9 of 10
20. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 10 of 10
